# Task 4.6 - Methods for combining data
# Chloe deBeus

## Task 4.6 Reading examples
### 01. Concatenating

In [2]:
import pandas as pd
import numpy as np
import os

In [4]:
# Define a dictionary containing January 2020 data
data1 = {'customer_id':['6732', '767', '890', '635'],
    'month':['Jan-20', 'Jan-20', 'Jan-20', 'Jan-20'],
    'purchased_meat':[0, 13, 3, 4],
    'purchased_alcohol':[1, 2, 10, 0],
    'purchased_snacks':[10, 5, 1, 7]}

# Define a dictionary containing February 2020 data
data2 = {'customer_id':['6732', '767', '890', '635'],
    'month':['Feb-20', 'Feb-20', 'Feb-20', 'Feb-20'],
    'purchased_meat':[0, 10, 5, 3],
    'purchased_alcohol':[2, 4, 14, 0],
    'purchased_snacks':[15, 3, 2, 6]}

In [8]:
#convert dictionary into dataframe
df_1 = pd.DataFrame(data1, index=[0,1,2,3])
df_2 =  pd.DataFrame(data2, index=[0,1,2,3])

In [9]:
df_1

  customer_id   month  purchased_meat  purchased_alcohol  purchased_snacks
0        6732  Jan-20               0                  1                10
1         767  Jan-20              13                  2                 5
2         890  Jan-20               3                 10                 1
3         635  Jan-20               4                  0                 7

In [10]:
df_2

  customer_id   month  purchased_meat  purchased_alcohol  purchased_snacks
0        6732  Feb-20               0                  2                15
1         767  Feb-20              10                  4                 3
2         890  Feb-20               5                 14                 2
3         635  Feb-20               3                  0                 6

In [14]:
#creat a list
frames = [df_1, df_2]
frames_concat = pd.concat(frames)
frames_concat
#the default is axis = 0 which is the columns
#when wanting to create a side-by-side, you must specify the axis = 1

  customer_id   month  purchased_meat  purchased_alcohol  purchased_snacks
0        6732  Jan-20               0                  1                10
1         767  Jan-20              13                  2                 5
2         890  Jan-20               3                 10                 1
3         635  Jan-20               4                  0                 7
0        6732  Feb-20               0                  2                15
1         767  Feb-20              10                  4                 3
2         890  Feb-20               5                 14                 2
3         635  Feb-20               3                  0                 6

In [17]:
frames_concat = pd.concat(frames, axis = 1)
frames_concat
#the wide makes sense as the customer ids across the rows are the same

,customer_id,month,purchased_meat,purchased_alcohol,purchased_snacks,customer_id,month,purchased_meat,purchased_alcohol,purchased_snacks
0,6732,Jan-20,0,1,10,6732,Feb-20,0,2,15
1,767,Jan-20,13,2,5,767,Feb-20,10,4,3
2,890,Jan-20,3,10,1,890,Feb-20,5,14,2
3,635,Jan-20,4,0,7,635,Feb-20,3,0,6

In [35]:
df_merged = df_1.merge(df_2, on = 'customer_id', indicator = True)
df_merged

,customer_id,month_x,purchased_meat_x,purchased_alcohol_x,purchased_snacks_x,month_y,purchased_meat_y,purchased_alcohol_y,purchased_snacks_y,_merge
0,6732,Jan-20,0,1,10,Feb-20,0,2,15,both
1,767,Jan-20,13,2,5,Feb-20,10,4,3,both
2,890,Jan-20,3,10,1,Feb-20,5,14,2,both
3,635,Jan-20,4,0,7,Feb-20,3,0,6,both

In [55]:
#this code does not work, and I'm not sure why. I think it's because of the lack of matching?
df_merged_new = df_1.merge(df_2, on = ['customer_id', 'month'])
df_merged_new

Empty DataFrame
Columns: [customer_id, month, purchased_meat_x, purchased_alcohol_x, purchased_snacks_x, purchased_meat_y, purchased_alcohol_y, purchased_snacks_y]
Index: []

In [27]:
df_1

  customer_id   month  purchased_meat  purchased_alcohol  purchased_snacks
0        6732  Jan-20               0                  1                10
1         767  Jan-20              13                  2                 5
2         890  Jan-20               3                 10                 1
3         635  Jan-20               4                  0                 7

In [28]:
df_2

  customer_id   month  purchased_meat  purchased_alcohol  purchased_snacks
0        6732  Feb-20               0                  2                15
1         767  Feb-20              10                  4                 3
2         890  Feb-20               5                 14                 2
3         635  Feb-20               3                  0                 6

In [3]:
mainPath = r'C:\Users\18286\Documents\Career Foundry\05_2023_Instacart Basket Analysis'
prior_orders = pd.read_csv(os.path.join(mainPath, '02 Datasets', 'Original data', 'order_products__prior.csv'), index_col = False)
df_orders = pd.read_csv(os.path.join(mainPath, '02 Datasets', 'Original data', 'orders.csv'), index_col = False)
df_orders_clean = pd.read_csv(os.path.join(mainPath, '02 Datasets', 'Clean data', 'orders_wrangled.csv'), index_col = False)

In [4]:
prior_orders.shape

(32434489, 4)

In [7]:
df_orders_clean.shape

(3421083, 9)

In [8]:
prior_orders.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [9]:
df_orders.head()

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,prior,1,2,8,NaN
1,2398795,1,prior,2,3,7,15.0
2,473747,1,prior,3,3,12,21.0
3,2254736,1,prior,4,4,7,29.0
4,431534,1,prior,5,4,15,28.0

In [10]:
df_orders_clean.drop(columns = {'eval_set'}, inplace = True)

In [11]:
df_orders_clean.rename(columns = {'order_dow':'orders_day_of_week', 'order_hour_of_day':'order_time_of_day'}, inplace = True)

In [12]:
# Change types for ords data set

df_orders_clean['order_id']=df_orders_clean['order_id'].astype('int32')
df_orders_clean['user_id'] = df_orders_clean['user_id'].astype('int32')
df_orders_clean['order_number']=df_orders_clean['order_number'].astype('int8')
df_orders_clean['orders_day_of_week']=df_orders_clean['orders_day_of_week'].astype('int8')
df_orders_clean['order_time_of_day']=df_orders_clean['order_time_of_day'].astype('int8')
df_orders_clean['days_since_prior_order']=df_orders_clean['days_since_prior_order'].astype('float16')

In [13]:
# Change types for ords prods data set 

prior_orders['product_id'] =prior_orders['product_id'].astype('int32')
prior_orders['reordered']=prior_orders['reordered'].astype('int8')
prior_orders['add_to_cart_order']=prior_orders['add_to_cart_order'].astype('int32')
prior_orders['order_id']=prior_orders['order_id'].astype('int32')

In [14]:
prior_orders.shape

(32434489, 4)

In [15]:
df_merged_orders = df_orders_clean.merge(prior_orders, on = 'order_id', how = 'outer', indicator = True)

In [16]:
df_merged_orders['_merge'].value_counts(dropna = False)

both          32434489
left_only       206209
right_only           0
Name: _merge, dtype: int64

In [17]:
df_merged_orders.shape

(32640698, 12)

In [103]:
df_merged_orders.to_pickle(os.path.join(mainPath, '02 Datasets','Clean Data', 'orders_products_combined.pkl'))